# 题目：有四个数字：1、2、3、4，能组成多少个互不相同且无重复数字的三位数？各是多少？
# 程序分析：可填在百位、十位、个位的数字都是1、2、3、4。组成所有的排列后再去 掉不满足条件的排列。

# count=0
# for i in range(1,4+1):
#     for j in range(1,4+1):
#         for k in range(1,4+1):
#             if i!=j and i!=k and j!=k:
#                 count+=1
#                 print(i,j,k)
# print(count)

# 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%;
# 高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？

# 程序分析：请利用数轴来分界，定位。

i = int(input('retained profits:'))
arr = [1000000, 600000, 400000, 200000, 100000, 0]
rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
r = 0
for index in range(0, 6):
    if i > arr[index]:
        r += (i - arr[index])*rat[index]
        print((i - arr[index])*rat[index])
        i = arr[index]
print(r)
